# p 'Дан целочисленный массив. Найти количество четных элементов.'
# p "[1,2,3].some_method"
# p [1,2,3].some_method
# p '--------------'
#
# 1. строка с заданием
# 2.строка с условием (чтобы мы могли понять исходные данные)
# 3.строка вывода результата решения
# 4.разделительная строка для задач

puts '1.Дан целочисленный массив. Необходимо вывести вначале его элементы с четными индексами, а затем - с нечетными.'
puts 'mas = [ "a", "b", "c","d","2","3","4","5" ]'
mas1 = %w[a b c d 2 3 4 5]
mas1.each_index { |x| print mas1[x] if x.even? }
mas1.each_index { |x| print mas1[x] if x.odd? }
puts ''
puts '--------------------------------------------------------'

puts '2.Дан целочисленный массив. Необходимо вывести вначале его элементы с нечетными индексами, а затем - четными.'
puts 'mas = [ "a", "b", "c","d","2","3","4","5" ]'
mas2 = %w[a b c d 2 3 4 5]
mas2.each_index { |x| print mas2[x] if x.odd? }
mas2.each_index { |x| print mas2[x] if x.even? }
puts ''
puts '--------------------------------------------------------'

puts '3.Дан целочисленный массив. Вывести номер первого из тех его элементов,
#которые удовлетворяют двойному неравенству: A[0] < A[i] < A[-1].
#Если таких элементов нет, то вывести [ ].'
puts "mas3 = ['2', '8', '5', '5', '8']"

mas3 = ['2', '8', '5', '5', '8']

def task3(arr)
  a = arr[0]
  b = arr[-1]
  f = 0
  arr.length.times do |i|
    x = arr[i]
    if a < x && x < b
      puts arr.index(x)
      f = f+1
      break
    end
  end
  print "[]" if f.zero?
end
task3(mas3)
puts "-------------------------------------------------------------------------"

puts '4.НЕ РЕШЕНА!Дан целочисленный массив. Вывести номер последнего из тех его элементов,
которые удовлетворяют двойному неравенству: A[0] < A[i] < A[-1].
Если таких элементов нет, то вывести [ ].'
puts "mas4 = ['2', '5', '5', '5', '7']"

mas4 = ['2', '5', '5', '5', '7']
def task4(arr)
  a = arr[0]
  b = arr[-1]
  f = 0
  ind = 0
  arr.length.times do |i|
    x = arr[i]
    if a < x && x < b
      f = f+1
      ind = arr.index(x)
    end
  end
  puts f
  puts ind
  print "[]" if f.zero?
end
task4(mas4)
puts'-----------------------------------------------------------------'

p'5. Дан целочисленный массив. Упорядочить его по возрастанию.'
p "mas5 = [2, 8, 9, 5, 7]"
p "#{[2, 8, 9, 5, 7].sort!}."
puts'-----------------------------------------------------------------'

p'6. Дан целочисленный массив. Упорядочить его по убыванию.'
p "mas6 = [2, 8, 9, 5, 7]"
p "#{[2, 8, 9, 5, 7].sort!{ |a, b| b <=>a }}."
puts'-----------------------------------------------------------------'

p '7. НЕ РАБОТАЕТ. РАЗОБРАТЬСЯ  Дан целочисленный массив. Преобразовать его, прибавив к четным числам первый
элемент. Первый и последний элементы массива не изменять.	'
p "mas7 = ['2', '8', '9', '5', '7']"
mas7 = ['1', '2', '3', '4', '5']
def task7(arr)
  tempAr = [] << arr[0]
  a = arr[0]
  lastIndex = arr.length - 1
  arr.length.times do |i|
    x = i
    if x % 2 == 0 && x != lastIndex && x != 0
      z = arr[i] + a
      tempAr.push(z)
    end
  end
  tempAr << arr[-1]
  return tempAr
end
p"#{task7(mas7)}"
puts "-------------------------------------------------------------------------"

p "8 Дано целое число. Найти сумму его цифр."
int8 = 12345
def sum(num)
  num.to_s.split('').map(&:to_i).reduce(:+)
end

p"#{sum(int8)}"

puts "-------------------------------------------------------------------------"

p "9 Дан целочисленный массив. Найти индекс максимального элемента."
p "arr9 = [1, 8, 9, 6, 7]"
arr9 = [1, 8, 9, 6, 7]
p arr9.index(arr9.max)

puts "-------------------------------------------------------------------------"

p "10 Дан целочисленный массив. Найти индекс минимального элемента."
p "arr9 = [1, 8, 9, 6, 7]"
arr9 = [1, 8, 9, 6, 7]
p arr9.index(arr9.min)

puts "-------------------------------------------------------------------------"

p "11 Дан целочисленный массив. Найти индекс первого минимального элемента."
p "mas11 = [2, 8, 1, 1, 7]"
mas11 = [2, 8, 1, 1, 7]
def task11(arr)
  min_value = arr[0]
  min_index = 0
  arr.each_with_index do |v, i|
    if v < min_value
      min_value = v
      min_index = i
    end
  end
  puts min_index
end
task11(mas11)
puts "-------------------------------------------------------------------------"


p "12 Дан целочисленный массив. Найти индекс первого максимального элемента.(копипаст задачи 9, так как полностью удовлетворяет условию)"
p "mas12 = ['2', '9', '6', '9', '7']"
mas12 = ['2', '9', '6', '9', '7']
def task12(arr)
  max_value = 0
  max_index = nil
  arr.each_with_index do |v, i|
    if v.to_i > max_value
      max_value = v.to_i
      max_index = i
    end
  end
  puts max_index
end
task12(mas12)
puts "-------------------------------------------------------------------------"

p "13 Дан целочисленный массив. Найти минимальный четный элемент."
arr30 = [1, 2, 5, 8, 1, 7]
p arr30.select { |x|  x.even? }.min

puts "-------------------------------------------------------------------------"


p "14 Дан целочисленный массив. Найти количество четных элементов."
p "mas14 = [2, 9, 2, 6, 7]"

mas14 = [2, 9, 2, 6, 7]
def task14(arr)
  count = 0
    arr.each do |x|
      if x.even?
        count = count+1
      end
    end
  puts count
end
task14(mas14)
puts "-------------------------------------------------------------------------"



    p "15 Дан целочисленный массив. Осуществить циклический сдвиг элементов массива вправо на одну позицию."
p "mas15 = ['2', '9', '1', '1', '7']"

mas15 = ['2', '9', '1', '1', '7']
def task15(arr)
  arr.unshift(arr.pop)
end
puts task15(mas15)
puts "-------------------------------------------------------------------------"


p "16 Дан целочисленный массив. Осуществить циклический сдвиг элементов массива влево на одну позицию."
mas16 = ['2', '9', '1', '1', '7']

def task16(m)
  m[1..-1] + [m[0]]
end
puts task16(mas16)

p "17 Дан целочисленный массив. Вывести индексы массива в том порядке, в котором соответствующие им элементы образуют убывающую последовательность."
p "mas17 = ['2', '9', '1', '1', '7']"
mas17 = ['2', '9', '1', '1', '7']
def task17(m)
  p (0...m.size).sort_by{ |i| m[i] }.reverse
end
task17(mas17)

p "18 Дан целочисленный массив. Вывести индексы массива в том порядке, в котором соответствующие им элементы образуют возрастающую  последовательность."
p "mas18 = ['2', '9', '1', '1', '7']"
mas18 = ['2', '9', '1', '1', '7']
def task18(m)
  p (0...m.size).sort_by{ |i| m[i] }
end
task18(mas18)
puts "-------------------------------------------------------------------------"

p "19 Дан целочисленный массив. Найти максимальный четный элемент."
"p mas19 = [2,9,9,1,6,3,7]"
mas19 = [2,9,9,1,6,3,7]
def task19(arr)
  p arr.select {|n| n.even?}.max

end
task19(mas19)

puts "-------------------------------------------------------------------------"


p "21 Дан целочисленный массив. Найти количество минимальных элементов."
p "arr21 = ['2', '9', '1', '1', '7']"
arr21 = ['1', '9', '1', '1', '7']
p arr21.select{|e| e==arr21.min}.size


p "22 Дан целочисленный массив. Найти количество максимальных элементов."
p "arr22 = ['2', '9', '1', '1', '7']"
arr22 = ['1', '9', '1', '1', '7']
p arr22.select{|e| e==arr22.max}.size

p "23 Дан целочисленный массив. Найти количество элементов, между первым и последним минимальным."
p "array = [4, 3, 7, 5, 3, 6, 7]"
array = [4, 3, 7, 5, 3, 6, 7]
max_value_int = array.min
first_max = array.index(max_value_int)
last_max = array.rindex(max_value_int)
p array[first_max, last_max].count -2
p "-------------------------------------------------------------------------"

p "24 Дан целочисленный массив. Найти количество элементов, между первым и последним максимальным."
p "array = [4, 3, 7, 5, 3, 6, 7]"
array = [4, 3, 7, 5, 3, 6, 7]
max_value_int = array.max
first_max = array.index(max_value_int)
last_max = array.rindex(max_value_int)
p array[first_max+1 ... last_max].size
p "-------------------------------------------------------------------------"


p "25 Дано целое число. Найти произведение его цифр.."
int25 = 12345
def sum(num)
  num.to_s.split('').map(&:to_i).reduce(:*)
end

p"#{sum(int25)}"

p "-------------------------------------------------------------------------"

p "26 Дан целочисленный массив. Найти два наибольших элемента."
p "arr26 = [7,3,4,6,0,3,6,0,9,1]"
# arr.sort!
# arr.uniq!
# p arr[-2..-1]
# или arr.uniq.sort[index1, index2]
p "array = [7,3,4,6,0,3,6,0,9,1]"
arr26 = [7,3,4,6,0,3,6,0,9,1]
p arr26.sort.uniq[-2..-1]

p "27 Дан целочисленный массив. Найти два наименьших элемента."
p "arr27 = [7,3,4,6,0,3,6,0,9,1]"
arr27 = [7,3,4,6,0,3,6,0,9,1]
p arr27.uniq.sort[0..1]

p "28 Дан целочисленный массив. Вывести вначале все его четные элементы, а затем - нечетные."
p "arr28 = [2,1,4,7,]"
arr28 = [2,1,4,7,]
 arr28.each { |x| print x if x.even? }
 arr28.each { |x| print x if x.odd? }
p ''
p '--------------------------------------------------------'

p "29 Дан целочисленный массив. Вывести вначале все его четные элементы, а затем - нечетные."
p "arr29 = [2,1,4,7,]"
arr29 = [2,1,4,7,]
arr29.each { |x| print x if x.odd? }
arr29.each { |x| print x if x.even?  }
p " "
p'--------------------------------------------------------'

p "30 Дан целочисленный массив. Найти минимальный нечетный элемент. (13 - even)	"
p "arr30 = [1, 2, 5, 8, 1, 7]"
arr30 = [1, 2, 5, 8, 1, 7]
p arr30.select { |x|  x.odd? }.min
p'--------------------------------------------------------'

p "31 Дан целочисленный массив. Найти максимальный нечетный элемент."
p "arr31 = [1, 2, 5, 8, 1, 7]"
arr31 = [1, 2, 5, 8, 1, 7]
p arr31.select { |x|  x.odd? }.max
p'--------------------------------------------------------'

p "32 Дан целочисленный массив. Найти минимальный положительный элемент."
p "arr32 = [1, 2, 5, 8, 1, 7]"
arr32 = [1, 2, 5, 8, 1, 7]
p arr32.select { |x|  x > 0 }.min
p'--------------------------------------------------------'

p "33 Дан целочисленный массив. Найти максимальный отрицательный элемент."
p "arr33 = [1, 2, 5, -8, -1, 7]"
arr33 = [1, 2, 5, -8, -1, 7]
p arr33.select { |x|  x < 0 }.max
p'--------------------------------------------------------'

p "34 Дан целочисленный массив. Найти индекс последнего минимального элемента."
p "arr34 = [4, 3, 7, 5, 3, 6, 7]"
arr34 = [4, 3, 7, 5, 3, 6, 7]
p arr34.rindex(arr34.min)
p'--------------------------------------------------------'

p "35 Дан целочисленный массив. Найти индекс последнего максимального элемента."
p "arr34 = [4, 3, 7, 5, 3, 6, 7]"
arr35 = [4, 3, 7, 5, 3, 6, 7]
p arr35.rindex(arr35.max)
p'--------------------------------------------------------'

p "36 Дан целочисленный массив. Найти количество четных элементов."
p "arr36 = [2, 3, 2, 5, 2, 2, 7]"
arr36 = [2, 3, 2, 5, 2, 2, 7]
p arr36.select! { |x| x.even?}.size
p'--------------------------------------------------------'

p "37 Дан целочисленный массив. Найти количество нечетных элементов."
p "arr37 = [2, 1, 2, 3, 2, 2, 5]"
arr37 = [2, 1, 2, 3, 2, 2, 5]
p arr37.select! { |x| x.odd?}.size
p'--------------------------------------------------------'

p "38 Дан целочисленный массив. Найти все нечетные элементы."
p "arr38 = [2, 1, 2, 3, 2, 2, 5]"
arr38 = [2, 1, 2, 3, 2, 2, 5]
p arr38.select! { |x| x.odd?}
p'--------------------------------------------------------'

p "39 Дан целочисленный массив. Найти все четные элементы.	"
p "arr39 = [2, 1, 2, 3, 2, 2, 5]"
arr39 = [2, 1, 2, 3, 2, 2, 5]
p arr39.select! { |x| x.even?}
p'--------------------------------------------------------'

p "40 Дан целочисленный массив и число К. Если существует элемент, меньший К, то вывести true; в противном случае вывести false."
p "arr40 = [2, 1, 2, 3, 2, 2, 5]"
arr40 = [2, 1, 2, 3, 2, 2, 5]
k = 4
p { arr40.any? { |x| x < k } }
p'--------------------------------------------------------'

p "41 Дан целочисленный массив и число К. Если существует элемент, больший К, то вывести true; в противном случае вывести false.	"
p "arr40 = [2, 1, 2, 3, 2, 2,]"
arr41 = [2, 1, 2, 3, 2, 2,]
k = 4
p { arr41.any? { |x| x > k } }
p'--------------------------------------------------------'

p "42 Дан целочисленный массив и число К. Если все элементы массива меньше К, то вывести true; в противном случае вывести false."
p "arr42 = [2, 1, 2, 5, 2, 2]"
arr42 = [2, 1, 2, 5, 2, 2]
k = 4
p "#{ arr42.all? { |x| x < k } }"
p'--------------------------------------------------------'

p "43 Дан целочисленный массив и число К. Если все элементы массива больше К, то вывести true; в противном случае вывести false."
p "arr43 = [2, 1, 2, 5, 2, 2]"
arr43 = [2, 1, 2, 5, 2, 2]
k = 4
p "#{ arr43.all? { |x| x > k } }"
p'--------------------------------------------------------'

p "44 Дан целочисленный массив и число К. Вывести количество элементов, меньших К."
p "arr44 = [2, 1, 2, 5, 2, 2]"
arr44 = [2, 6, 2, 5, 7, 2]
k = 4
p arr44.select { |x| x < k }.size
p'--------------------------------------------------------'

p "45 Дан целочисленный массив. Найти количество элементов, расположенных после последнего максимального."
p "arr45 = [2, 6, 2, 5, 7, 2,4,3]"
arr45 = [2, 6, 2, 5, 7, 2,4,3]
max_val_arr45 = arr45.max
max_last_ind_arr45 = arr45.rindex(max_val_arr45)
p arr45.size - max_last_ind_arr45 - 1
p'--------------------------------------------------------'

p "46 Дан целочисленный массив. Найти количество элементов, расположенных после последнего минимального."
p "arr46 = [2, 6, 2, 5, 7, 2,4,3]"
arr46 = [2, 6, 2, 5, 7, 2,4,3]
p arr46.size - arr46.rindex(arr46.min) - 1
p'--------------------------------------------------------'

p "47 Дан дипапазон a..b. Получить массив из чисел, расположенных в этом диапазоне (исключая сами эти числа),
в порядке их убывания, а также размер этого массива."
p "(1..10)"
range47 = (1..10)
arr_range47 = range47.to_a.sort! { |a, b| b <=> a }
arr_range47.delete_at(0)
arr_range47.pop
p arr_range47
p arr_range47.size
p'--------------------------------------------------------'

p "48 Дан дипапазон a..b. Получить массив из чисел, расположенных в этом диапазоне (исключая сами эти числа),
в порядке их возрастания, а также размер этого массива."
p "(1..10)"
range48 = (1..10)
arr_range48 = range48.to_a.sort!
arr_range48.delete_at(0)
arr_range48.pop
p arr_range48
p arr_range48.size
p'--------------------------------------------------------'

p "49 Дан целочисленный массив и число К. Вывести индекс первого элемента, большего К."
p "arr49 = [2, 6, 2, 5, 7, 2]"
arr49 = [2, 6, 2, 5, 7, 2]
k = 4
p arr49.index(arr49.detect { |i| i > k })
p'--------------------------------------------------------'

p "50 Дан целочисленный массив и число К. Вывести индекс последнего элемента, меньшего К."
p "arr50 = [2, 6, 2, 5, 7, 8]"
arr50 = [2, 6, 1, 5, 7, 8]
k = 4
p arr50.index(arr50.reverse.detect { |i| i < k })
p'--------------------------------------------------------'


